tests/data/pgbench_pd_2.txt
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 11116
number of failed transactions: 0 (0.000%)
latency average = 54.615 ms
initial connection time = 53.345 ms
tps = 183.100496 (without initial connection time)
statement latencies in milliseconds and failures:
         0.002           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        10.935           0  BEGIN;
        10.991           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        10.855           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        10.881           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        10.898           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 30
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 29327
number of failed transactions: 0 (0.000%)
latency average = 61.272 ms
initial connection time = 159.466 ms
tps = 489.623037 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        12.626           0  BEGIN;
        12.297           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        12.161           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        12.126           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        12.227           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 47582
number of failed transactions: 0 (0.000%)
latency average = 63.164 ms
initial connection time = 311.782 ms
tps = 791.591858 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        12.544           0  BEGIN;
        12.543           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        12.440           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        12.778           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        12.617           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 106481
number of failed transactions: 0 (0.000%)
latency average = 56.641 ms
initial connection time = 476.873 ms
tps = 1765.506437 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        11.186           0  BEGIN;
        11.289           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        11.168           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        11.299           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.209           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 300
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 301632
number of failed transactions: 0 (0.000%)
latency average = 57.569 ms
initial connection time = 2400.911 ms
tps = 5211.163360 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        11.506           0  BEGIN;
        11.565           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        11.513           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        11.465           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.415           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 500
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 346814
number of failed transactions: 0 (0.000%)
latency average = 83.281 ms
initial connection time = 2695.940 ms
tps = 6003.801492 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        16.693           0  BEGIN;
        15.998           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        17.104           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        16.535           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        16.569           0  END;